garyPenhook/PIC-Assembler/Microchip.PIC12-16F1xxx_DFP.1.8.254.atpack_FILES/edc/PIC16LF1713.PIC
        <edc:SFRDef edc:access="nrnnnnnn" edc:cname="FVRCON" edc:desc="Voltage Reference Control Register 0" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0q000000" edc:name="FVRCON" edc:nzwidth="8" edc:por="0q000000" edc:_addr="0x117">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ADFVR" edc:desc="A/D Converter Fixed Voltage Reference Selection" edc:mask="0x3" edc:name="ADFVR" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="CDAFVR" edc:desc="" edc:mask="0x3" edc:name="CDAFVR" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="TSRNG" edc:desc="Temperature Sensor Range Select" edc:mask="0x1" edc:name="TSRNG" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TSEN" edc:desc="Temperature Sensor Enable" edc:mask="0x1" edc:name="TSEN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FVRRDY" edc:desc="Fixed Voltage Reference Ready Flag" edc:mask="0x1" edc:name="FVRRDY" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FVREN" edc:desc="Fixed Voltage Reference Enable" edc:mask="0x1" edc:name="FVREN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="ADFVR0" edc:desc="A/D Converter Fixed Voltage Reference Selection" edc:mask="0x1" edc:name="ADFVR0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADFVR1" edc:desc="A/D Converter Fixed Voltage Reference Selection" edc:mask="0x1" edc:name="ADFVR1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CDAFVR0" edc:desc="" edc:mask="0x1" edc:name="CDAFVR0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CDAFVR1" edc:desc="" edc:mask="0x1" edc:name="CDAFVR1" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="n-nnnn-n" edc:cname="DAC1CON0" edc:desc="" edc:impl="0xbd" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0-0000-0" edc:name="DAC1CON0" edc:nzwidth="8" edc:por="0-0000-0" edc:_modsrc="DOS-01354_8bit_DAC.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x2" edc:_addr="0x118">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="DAC1NSS" edc:desc="" edc:mask="0x1" edc:name="DAC1NSS" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="DAC1PSS" edc:desc="" edc:mask="0x3" edc:name="DAC1PSS" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="DAC1OE2" edc:desc="" edc:mask="0x1" edc:name="DAC1OE2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DAC1OE1" edc:desc="" edc:mask="0x1" edc:name="DAC1OE1" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="DAC1EN" edc:desc="" edc:mask="0x1" edc:name="DAC1EN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="DAC1PSS0" edc:desc="" edc:mask="0x1" edc:name="DAC1PSS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DAC1PSS1" edc:desc="" edc:mask="0x1" edc:name="DAC1PSS1" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="DACNSS" edc:desc="" edc:mask="0x1" edc:name="DACNSS" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="DACPSS" edc:desc="" edc:mask="0x3" edc:name="DACPSS" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="DACOE0" edc:desc="" edc:mask="0x1" edc:name="DACOE0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DACOE1" edc:desc="" edc:mask="0x1" edc:name="DACOE1" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="DACEN" edc:desc="" edc:mask="0x1" edc:name="DACEN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="DACPSS0" edc:desc="" edc:mask="0x1" edc:name="DACPSS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DACPSS1" edc:desc="" edc:mask="0x1" edc:name="DACPSS1" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="DAC1CON1" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="DAC1CON1" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-01354_8bit_DAC.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x2" edc:_addr="0x119">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="DAC1R" edc:desc="" edc:mask="0xff" edc:name="DAC1R" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="DAC1R0" edc:desc="" edc:mask="0x1" edc:name="DAC1R0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DAC1R1" edc:desc="" edc:mask="0x1" edc:name="DAC1R1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DAC1R2" edc:desc="" edc:mask="0x1" edc:name="DAC1R2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DAC1R3" edc:desc="" edc:mask="0x1" edc:name="DAC1R3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DAC1R4" edc:desc="" edc:mask="0x1" edc:name="DAC1R4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DAC1R5" edc:desc="" edc:mask="0x1" edc:name="DAC1R5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DAC1R6" edc:desc="" edc:mask="0x1" edc:name="DAC1R6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DAC1R7" edc:desc="" edc:mask="0x1" edc:name="DAC1R7" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="DACR0" edc:desc="" edc:mask="0x1" edc:name="DACR0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DACR1" edc:desc="" edc:mask="0x1" edc:name="DACR1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DACR2" edc:desc="" edc:mask="0x1" edc:name="DACR2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DACR3" edc:desc="" edc:mask="0x1" edc:name="DACR3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DACR4" edc:desc="" edc:mask="0x1" edc:name="DACR4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DACR5" edc:desc="" edc:mask="0x1" edc:name="DACR5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DACR6" edc:desc="" edc:mask="0x1" edc:name="DACR6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DACR7" edc:desc="" edc:mask="0x1" edc:name="DACR7" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="n-nnnn-n" edc:cname="DAC2CON0" edc:desc="" edc:impl="0xbd" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0-0000-0" edc:name="DAC2CON0" edc:nzwidth="8" edc:por="0-0000-0" edc:_modsrc="DOS-01073_5bit_DAC_wNSS.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x2" edc:_addr="0x11A">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="NSS" edc:desc="" edc:mask="0x1" edc:name="NSS" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="PSS" edc:desc="" edc:mask="0x3" edc:name="PSS" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="OE2" edc:desc="" edc:mask="0x1" edc:name="OE2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OE1" edc:desc="" edc:mask="0x1" edc:name="OE1" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="EN" edc:desc="" edc:mask="0x1" edc:name="EN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="PSS0" edc:desc="" edc:mask="0x1" edc:name="PSS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PSS1" edc:desc="" edc:mask="0x1" edc:name="PSS1" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="DACNSS" edc:desc="" edc:mask="0x1" edc:name="DACNSS" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="DACPSS" edc:desc="" edc:mask="0x3" edc:name="DACPSS" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="DACOE2" edc:desc="" edc:mask="0x1" edc:name="DACOE2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DACOE1" edc:desc="" edc:mask="0x1" edc:name="DACOE1" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="DACEN" edc:desc="" edc:mask="0x1" edc:name="DACEN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="DACPSS0" edc:desc="" edc:mask="0x1" edc:name="DACPSS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DACPSS1" edc:desc="" edc:mask="0x1" edc:name="DACPSS1" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.3">
              <edc:SFRFieldDef edc:cname="DAC2NSS" edc:desc="" edc:mask="0x1" edc:name="DAC2NSS" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="DAC2PSS" edc:desc="" edc:mask="0x3" edc:name="DAC2PSS" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="DAC2OE2" edc:desc="" edc:mask="0x1" edc:name="DAC2OE2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DAC2OE1" edc:desc="" edc:mask="0x1" edc:name="DAC2OE1" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="DAC2EN" edc:desc="" edc:mask="0x1" edc:name="DAC2EN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.4">
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="DAC2PSS0" edc:desc="" edc:mask="0x1" edc:name="DAC2PSS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DAC2PSS1" edc:desc="" edc:mask="0x1" edc:name="DAC2PSS1" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="DAC2REF" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000" edc:name="DAC2REF" edc:nzwidth="8" edc:por="---00000" edc:_modsrc="DOS-01073_5bit_DAC_wNSS.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x2" edc:_addr="0x11B">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="DAC2CON1"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="DACR" edc:desc="" edc:mask="0x1f" edc:name="DACR" edc:nzwidth="5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="DACR0" edc:desc="" edc:mask="0x1" edc:name="DACR0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DACR1" edc:desc="" edc:mask="0x1" edc:name="DACR1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DACR2" edc:desc="" edc:mask="0x1" edc:name="DACR2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DACR3" edc:desc="" edc:mask="0x1" edc:name="DACR3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DACR4" edc:desc="" edc:mask="0x1" edc:name="DACR4" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="R0" edc:desc="" edc:mask="0x1" edc:name="R0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="R1" edc:desc="" edc:mask="0x1" edc:name="R1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="R2" edc:desc="" edc:mask="0x1" edc:name="R2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="R3" edc:desc="" edc:mask="0x1" edc:name="R3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="R4" edc:desc="" edc:mask="0x1" edc:name="R4" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="DAC2R" edc:desc="" edc:mask="0x1f" edc:name="DAC2R" edc:nzwidth="5"/>
              <edc:AdjustPoint edc:offset="3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.3">
              <edc:SFRFieldDef edc:cname="DAC2R0" edc:desc="" edc:mask="0x1" edc:name="DAC2R0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DAC2R1" edc:desc="" edc:mask="0x1" edc:name="DAC2R1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DAC2R2" edc:desc="" edc:mask="0x1" edc:name="DAC2R2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DAC2R3" edc:desc="" edc:mask="0x1" edc:name="DAC2R3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DAC2R4" edc:desc="" edc:mask="0x1" edc:name="DAC2R4" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.4">
              <edc:SFRFieldDef edc:cname="REF0" edc:desc="" edc:mask="0x1" edc:name="REF0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="REF1" edc:desc="" edc:mask="0x1" edc:name="REF1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="REF2" edc:desc="" edc:mask="0x1" edc:name="REF2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="REF3" edc:desc="" edc:mask="0x1" edc:name="REF3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="REF4" edc:desc="" edc:mask="0x1" edc:name="REF4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="REF5" edc:desc="" edc:mask="0x1" edc:name="REF5" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.5">
              <edc:SFRFieldDef edc:cname="DAC2REF0" edc:desc="" edc:mask="0x1" edc:name="DAC2REF0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DAC2REF1" edc:desc="" edc:mask="0x1" edc:name="DAC2REF1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DAC2REF2" edc:desc="" edc:mask="0x1" edc:name="DAC2REF2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DAC2REF3" edc:desc="" edc:mask="0x1" edc:name="DAC2REF3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DAC2REF4" edc:desc="" edc:mask="0x1" edc:name="DAC2REF4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DAC2REF5" edc:desc="" edc:mask="0x1" edc:name="DAC2REF5" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
